<template lang="pug">
  .task-description.pa-sm
    p Средствами Vue.js реализуйте небольшое приложение для заметок.
    br
    p Каждая заметка имеет название и список задач (todo list), далее - Todo. Каждый пункт Todo состоит из чекбокса и относящейся к нему текстовой подписи.
    br
    p Приложение состоит всего из 2х страниц.
    br
    p На главной странице отображается список всех заметок. Для каждой заметки отображается заголовок и Todo, сокращенный до нескольких пунктов, без возможности отмечать.
    p Действия на главной:
    p - перейти к созданию новой заметки
    p - перейти к изменению
    p - удалить (необходимо подтверждение)
    br
    p Страница изменения заметки позволяет определенную заметку отредактировать, отметить пункты Todo, а после сохранить изменения.
    p Действия с заметкой:
    p - сохранить изменения
    p - отменить редактирование (необходимо подтверждение)
    p - удалить (необходимо подтверждение)
    p - отменить внесенное изменение
    p - повторить отмененное изменение
    p Действия с пунктами Todo:
    p - добавить
    p - удалить
    p - отредактировать текст
    p - отметить как выполненный
    br
    p Требования к функционалу:
    p - Все действия на сайте должны происходить без перезагрузки страницы.
    p - Подтверждение действий (удалить заметку) выполняется с помощью диалогового окна.
    p - Интерфейс должен отвечать требованиям usability.
    p - После перезагрузки страницы состояние списка заметок должно сохраняться.
    p - Можно пренебречь несоответствием редактирования текста с помощью кнопок отменить/повторить и аналогичным действиям с помощью комбинацияй клавиш (Ctrl+Z, Command+Z, etc.).
    br
    p Технические требования:
    p - Диалоговые окна должны быть реализованы без использования "alert", "prompt" и "confirm".
    p - В качестве языка разработки допускается использовать JavaScript или TypeScript.
    p - В качестве сборщика, если это необходимо, используйте Webpack.
    p - Верстка должна быть выполнена без использования UI библиотек (например Vuetify).
    p - Адаптивность не обязательна, но приветствуется.
    p - Логика приложения должна быть разбита на разумное количество самодостаточных Vue-компонентов.
    br
    p Особое внимание стоит обратить на следующие моменты:
    p - Код должен быть написан понятно и аккуратно, с соблюдением табуляции и прочих элементов написания, без лишних элементов и функций, не имеющих отношения к функционалу тестового задания, снабжен понятными комментариями.
    p - Читабельность и наличие элементарной архитектуры.
    p - Чистота и оформление кода — не менее важный фактор. Код должен быть написан в едином стиле (желательно в рекомендуемом для конкретного языка). Также к чистоте относятся отсутствие копипаста и дублирования логики.
    br
    p Тестовое задание должно быть предоставлено в следующем виде:
    p - Ссылка на публичный репозиторий (GitHub, BitBucket, GitLab) с исходным кодом.
    p - Ссылка на сайт для тестирования функционала. Или Dockerfile и docker-compose.yaml, позволяющие развернуть локально командой docker-compose up работоспособную копию сайта.
</template>

<script>
export default {
  name: 'TaskPage',
  components: {},
  props: {
  },
  data () {
    return {
    }
  },
  computed: {},
  watch: {},
  created () {},
  mounted () {},
  updated () {},
  methods: {},
}
</script>
